ELPasEDT/src/Catalogs/КомплектыУчетныхЕдиниц/КомплектыУчетныхЕдиниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомплектыУчетныхЕдиниц</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияКоличества</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияКонцентрации</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПлотности</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ELPasEDT/src/InformationRegisters/КомплектУчетныхЕдиницПоУмолчанию/КомплектУчетныхЕдиницПоУмолчанию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомплектУчетныхЕдиницПоУмолчанию</name>
  <resources>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.КомплектыУчетныхЕдиниц</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/Catalogs/КомплектыУчетныхЕдиниц/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура УстановитьОсновнымНаСервере(Ссылка)
	
	Если Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МЗ = РегистрыСведений.КомплектУчетныхЕдиницПоУмолчанию.СоздатьМенеджерЗаписи();
	МЗ.Организация = Ссылка.Организация;
	МЗ.Реагент = Ссылка.Реагент;
	МЗ.Комплект = Ссылка;
	МЗ.Записать();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновным(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		УстановитьОсновнымНаСервере(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры
